{
    "id": "elem.11.18",
    "n": 18,
    "type": "proposition",
    "enunciation": "> If a straight line be at right angles to any plane, > all the planes through it will also be at right angles to the same plane.",
    "proof": [
        {
            "text": "For let any straight line > AB be at right angles to the plane of reference; I say that all the planes through > AB are also at right angles to the plane of reference.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "For let the plane > DE be drawn through > AB, let > CE be the common section of the plane > DE and the plane of reference, let a point > F be taken at random on > CE, and from > F let > FG be drawn in the plane > DE at right angles to > CE. [elem.1.11]",
            "refs": [
                "elem.1.11"
            ],
            "emphs": []
        },
        {
            "text": "Now, since > AB is at right angles to the plane of reference, > AB is also at right angles to all the straight lines which meet it and are in the plane of reference; [elem.11.def.3] so that it is also at right angles to > CE; therefore the angle > ABF is right.",
            "refs": [
                "elem.11.def.3"
            ],
            "emphs": []
        },
        {
            "text": "But the angle > GFB is also right; therefore > AB is parallel to > FG. [elem.1.28]",
            "refs": [
                "elem.1.28"
            ],
            "emphs": []
        },
        {
            "text": "But > AB is at right angles to the plane of reference; therefore > FG is also at right angles to the plane of reference. [elem.11.8]",
            "refs": [
                "elem.11.8"
            ],
            "emphs": []
        },
        {
            "text": "Now a plane is at right angles to a plane, when the straight lines drawn, in one of the planes, at right angles to the common section of the planes are at right angles to the remaining plane. [elem.11.def.4]",
            "refs": [
                "elem.11.def.4"
            ],
            "emphs": []
        },
        {
            "text": "And > FG, drawn in one of the planes > DE at right angles to > CE, the common section of the planes, was proved to be at right angles to the plane of reference; therefore the plane > DE is at right angles to the plane of reference.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "Similarly also it can be proved that all the planes through > AB are at right angles to the plane of reference.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "Therefore etc. Q. E. D.",
            "refs": [],
            "emphs": []
        }
    ]
}