{
    "id": "elem.9.9",
    "n": 9,
    "type": "proposition",
    "proof": [
        {
            "text": "Let there be as many numbers as we please, , , , , , , beginning from an unit and in continued proportion, and let , the number after the unit, be square; I say that all the rest will also be square.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "Now it has been proved that , the third from the unit, is square, as are also all those which leave out one; [elem.9.8] I say that all the rest are also square.",
            "refs": [
                "elem.9.8"
            ],
            "emphs": []
        },
        {
            "text": "For, since , ,  are in continued proportion, and  is square, therefore  is also square. [elem.8.22]",
            "refs": [
                "elem.8.22"
            ],
            "emphs": []
        },
        {
            "text": "Again, since , ,  are in continued proportion, and  is square,  is also square. [elem.8.22]",
            "refs": [
                "elem.8.22"
            ],
            "emphs": []
        },
        {
            "text": "Similarly we can prove that all the rest are also square.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "Next, let  be cube; I say that all the rest are also cube.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "Now it has been proved that , the fourth from the unit, is cube, as also are all those which leave out two; [elem.9.8] I say that all the rest are also cube.",
            "refs": [
                "elem.9.8"
            ],
            "emphs": []
        },
        {
            "text": "For, since, as the unit is to , so is  to , therefore the unit measures  the same number of times as  measures .",
            "refs": [],
            "emphs": []
        },
        {
            "text": "But the unit measures  according to the units in it; therefore  also measures  according to the units in itself; therefore  by multiplying itself has made .",
            "refs": [],
            "emphs": []
        },
        {
            "text": "And  is cube.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "But, if a cube number by multiplying itself make some number, the product is cube. [elem.9.3]",
            "refs": [
                "elem.9.3"
            ],
            "emphs": []
        },
        {
            "text": "Therefore  is also cube.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "And, since the four numbers , , ,  are in continued proportion, and  is cube,  also is cube. [elem.8.23]",
            "refs": [
                "elem.8.23"
            ],
            "emphs": []
        },
        {
            "text": "For the same reason  is also cube, and similarly all the rest are cube. Q. E. D.",
            "refs": [],
            "emphs": []
        }
    ]
}