{
    "id": "elem.11.18",
    "n": 18,
    "type": "proposition",
    "enunciation": ",",
    "proof": [
        {
            "text": "For let any straight line  be at right angles to the plane of reference; I say that all the planes through  are also at right angles to the plane of reference.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "For let the plane  be drawn through , let  be the common section of the plane  and the plane of reference, let a point  be taken at random on , and from  let  be drawn in the plane  at right angles to . [elem.1.11]",
            "refs": [
                "elem.1.11"
            ],
            "emphs": []
        },
        {
            "text": "Now, since  is at right angles to the plane of reference,  is also at right angles to all the straight lines which meet it and are in the plane of reference; [elem.11.def.3] so that it is also at right angles to ; therefore the angle  is right.",
            "refs": [
                "elem.11.def.3"
            ],
            "emphs": []
        },
        {
            "text": "But the angle  is also right; therefore  is parallel to . [elem.1.28]",
            "refs": [
                "elem.1.28"
            ],
            "emphs": []
        },
        {
            "text": "But  is at right angles to the plane of reference; therefore  is also at right angles to the plane of reference. [elem.11.8]",
            "refs": [
                "elem.11.8"
            ],
            "emphs": []
        },
        {
            "text": "Now a plane is at right angles to a plane, when the straight lines drawn, in one of the planes, at right angles to the common section of the planes are at right angles to the remaining plane. [elem.11.def.4]",
            "refs": [
                "elem.11.def.4"
            ],
            "emphs": []
        },
        {
            "text": "And , drawn in one of the planes  at right angles to , the common section of the planes, was proved to be at right angles to the plane of reference; therefore the plane  is at right angles to the plane of reference.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "Similarly also it can be proved that all the planes through  are at right angles to the plane of reference.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "Therefore etc. Q. E. D.",
            "refs": [],
            "emphs": []
        }
    ]
}