{
    "id": "elem.10.82",
    "n": 82,
    "type": "propositions 48—84",
    "enunciation": "> To a minor straight line only one straight line can be annexed which is incommensurable in square with the whole and which makes, with the whole, the sum of the squares on them rational but twice the rectangle contained by them medial.",
    "proof": [
        {
            "text": "Let > AB be the minor straight line, and let > BC be an annex to > AB;  therefore > AC, > CB are straight lines incommensurable in square which make the sum of the squares on them rational, but twice the rectangle contained by them medial. [elem.10.76]",
            "refs": [
                "elem.10.76"
            ],
            "emphs": []
        },
        {
            "text": "I say that no other straight line can be annexed to > AB fulfilling the same conditions.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "For, if possible, let > BD be so annexed; therefore > AD, > DB are also straight lines incommensurable in square which fulfil the aforesaid conditions. [elem.10.76]",
            "refs": [
                "elem.10.76"
            ],
            "emphs": []
        },
        {
            "text": "Now, since the excess of the squares on > AD, > DB over the squares on > AC, > CB is also the excess of twice the rectangle > AD, > DB over twice the rectangle > AC, > CB, while the squares on > AD, > DB exceed the squares on > AC, > CB by a rational area, for both are rational, therefore twice the rectangle > AD, > DB also exceeds twice the rectangle > AC, > CB by a rational area: which is impossible, for both are medial. [elem.10.26]",
            "refs": [
                "elem.10.26"
            ],
            "emphs": []
        },
        {
            "text": "Therefore to a minor straight line only one straight line can be annexed which is incommensurable in square with the whole and which makes the squares on them added together rational, but twice the rectangle contained by them medial. Q. E. D.",
            "refs": [],
            "emphs": []
        }
    ]
}