{
    "id": "elem.10.65",
    "n": 65,
    "type": "propositions 48—84",
    "enunciation": "> The square on the side of the sum of two medial areas applied to a rational straight line produces as breadth the sixth binomial.",
    "proof": [
        {
            "text": "Let > AB be the side of the sum of two medial areas, divided at > C, let > DE be a rational straight line, and let there be applied to > DE the parallelogram > DF equal to the square on > AB, producing > DG as its breadth; I say that > DG is a sixth binomial straight line.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "For let the same construction be made as before.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "Then, since > AB is the side of the sum of two medial areas, divided at > C, therefore > AC, > CB are straight lines incommensurable in square which make the sum of the squares on them medial, the rectangle contained by them medial, and moreover the sum of the squares on them incommensurable with the rectangle contained by them, [elem.10.41]  so that, in accordance with what was before proved, each of the rectangles > DL, > MF is medial.",
            "refs": [
                "elem.10.41"
            ],
            "emphs": []
        },
        {
            "text": "And they are applied to the rational straight line > DE; therefore each of the straight lines > DM, > MG is rational and incommensurable in length with > DE. [elem.10.22]",
            "refs": [
                "elem.10.22"
            ],
            "emphs": []
        },
        {
            "text": "And, since the sum of the squares on > AC, > CB is incommensurable with twice the rectangle > AC, > CB, therefore > DL is incommensurable with > MF.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "Therefore > DM is also incommensurable with > MG; [elem.6.1, elem.10.11] therefore > DM, > MG are rational straight lines commensurable in square only; therefore > DG is binomial. [elem.10.36]",
            "refs": [
                "elem.6.1",
                "elem.10.11",
                "elem.10.36"
            ],
            "emphs": []
        },
        {
            "text": "I say next that it is also a sixth binomial straight line.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "Similarly again we can prove that the rectangle > DK, > KM is equal to the square on > MN, and that > DK is incommensurable in length with > KM; and, for the same reason, the square on > DM is greater than the square on > MG by the square on a straight line incommensurable in length with > DM.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "And neither of the straight lines > DM, > MG is commensurable in length with the rational straight line > DE set out.",
            "refs": [],
            "emphs": []
        },
        {
            "text": "Therefore > DG is a sixth binomial straight line. Q. E. D.",
            "refs": [],
            "emphs": []
        }
    ]
}